{
  "Binary-to-Text": "Binary-to-Text encoding convert arbitrary data into text. Usually the target text standard is ASCII as that character set is accepted by almost all systems and does not require any modification to display. The main use for such an encoding is to allow data to be sent over channels that only accept text.",
  "Error Correcting": "Error correcting and error detecting codes take data and encode additional information so that if an error changes a bit from what it should be the decoding can either be immediately fix it or flag it as an error. Most error correcting codes assume that errors occur very rarely and that getting the data again is easy. For instance common bar codes incorporate very simple error detection since rescanning is trivial. In the case that errors are more common or resending is difficult strong error correction is used.",
  "Mathematical": "These codes all share the property of being made to encode the natural numbers.",
  "Other": "I couldn't think of a category to put these codes into. Feel free to make a suggestion!",
  "Text Standards": "Text standards are encodings of text characters in something other than their ordinary form. Most commonly when working with text electronically it must be turned into a form that can be transmitted or stored as a sequence of bits. Morse Code is one of the oldest ways of transforming text for this purpose while the modern UTF-8 encoding used across the internet efficiently encodes over a million characters.",
  "Prefix": "Prefix codes are a category of codes that share the property that no code every appears as the prefix of another code. This allows a sequence of codes to be presented without separately indicating where one code end and the next begins.\n\nThe simplest kind of prefix codes are block codes where all codes are the same length.\n\nFor very large collections more complex prefix codes are useful.",
  "Commercial": "These codes are used for commercial purposes such as barcodes."
}